Revit 2026 API

# FabricAreaFailures Properties

---

The BuiltInFailuresFabricAreaFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FabricAreaLapSplicesIncorrect | Fabric Area lap splice is incorrect. |
|  | FabricAreaOutSideOfHost | Fabric Area is sketched completely outside of its host. |

#### Reference

BuiltInFailuresFabricAreaFailures Class

Autodesk.Revit.DB Namespace